app/controllers/intuit_controller.rb

  def callback
    at = session[:request_token].get_access_token(:oauth_verifier => params[:oauth_verifier])
    session[:request_token] = nil
    if(@company = Company.where(:realm => params["realmId"]).first)
      @company.update_attributes(:owner => current_user, :intuit_access_token => at.token, :intuit_access_secret => at.secret)
      if(!@company.users.include?(current_user))
        @company.users << current_user
---
SELECT "companies".* FROM "companies" WHERE "companies"."realm" = '547147730' LIMIT 1
UPDATE "companies" SET "name" = 'TimeStackCompany', "updated_at" = '2012-11-19 19:27:37.212154' WHERE "companies"."id" = 1
INSERT INTO "companies" ("name", "realm", "owner_id", "intuit_access_token", "intuit_access_secret", "is_qbo", "created_at", "updated_at") VALUES ('', '547147730', 1, 'lvprdV3E7APqjAvTRWkqbdFLS7jzKkFZVgA2hqi4uj1ooksk', '30lRICzZdgV3qbISP6qdV1x9LOtA6to77R5bH5oD', 't', '2012-11-19 19:27:28.186102', '2012-11-19 19:27:28.186102')