app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "crypted_password", "password_salt", "persistence_token", "single_access_token", "perishable_token", "created_at", "updated_at") VALUES ('Juan', 'Estrada', 'jdestradap@gmail.com', 'f378d749c19039d75bb08dc34c446aca2f153e4fb0a236317d03e1c76b161eff6eabafb47d70af99d5a3a1922346d490c1e2cba7be787e593db7876c1fa05a0f', '0Wo5Y78wkeTt7RYDSPxx', '5799baea4a78332ba242eead7576ffbf8b2ec1da1b0b5f08771f1ff4a28876f74bb23c1515ae12904d8499e7273a22927cd66744907b4b52cc6f33a346242d99', '0bdG5TzTylWlnXLbnLw', 'xL5S1yERQCy4H16JO5oI', '2012-11-18 21:41:37.256677', '2012-11-18 21:41:37.256677')
---
  def create
    @user = User.new(params[:user])
    if @user.save